rails_projects/blogg/app/controllers/comments_controller.rb

  def create
  	@post = Post.find(params[:post_id])
  	@comment = @post.comments.build(params[:comment])
  	@comment.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "post_id", "created_at") VALUES('2013-12-30 09:23:43', 'nice one!!!', 1, '2013-12-30 09:23:43')

  def destroy
  	@comment=Comment.find(params[:id])
  	@comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 3)
DELETE FROM "comments" WHERE "id" = 3