rails_projects/blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`name`, `body`, `updated_at`, `title`, `created_at`) VALUES('Vinoth', 'India (Listeni/ˈɪndiə/), officially the Republic of India (Bharat Ganrajya),[c] is a country in South Asia. It is the seventh-largest country by area, the second-most populous country with over 1.2 billion people, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the south-west, and the Bay of Bengal on the south-east, it shares land borders with Pakistan to the west;[d] China, Nepal, and Bhutan to the north-east; and Burma and Bangladesh to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; in addition, India\'s Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.', '2013-12-30 05:56:40', 'India', '2013-12-30 05:56:40')

  def update
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)